#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-ftKkZG9osfh1A9YP

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=7b29c053fc5cb761c95c9482964ea488b26051d2842dc795acf8623781d3bc95]
data.template_file.composer_brew_user_data: Refreshing state... [id=ea1a2ce05e7ae4dd6719d89cbbd7879ca435e89e58a70d70c20c35f4cc6a6778]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=1330906063]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=2072117659]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state... [id=1116480091]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=690884195]
aws_instance.composer_brew: Refreshing state... [id=i-07cc2dbf5378ab3ff]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=2674406226]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state... [id=931116587]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder-spot-fleet-role]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116212912128900000002]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323839200000002]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116212912287200000003]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116212912375000000005]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116212912312400000004]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323938600000003]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0835b6ea478c7ad22]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0e024d07c5f88082f]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-00c2bbbe779d66f49]
aws_security_group.allow_icmp: Refreshing state... [id=sg-006658b39ca9f5b61]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-00901c19ede013963]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-0543de8f4ff71f41e]
aws_security_group.allow_egress: Refreshing state... [id=sg-0782a0692ac5b4fc8]
data.aws_subnet.internal_subnet_primary: Refreshing state... [id=subnet-04a176042c3118735]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
aws_ebs_volume.composer_brew: Refreshing state... [id=vol-0283d2f41d161a2d6]
aws_network_interface.composer_brew: Refreshing state... [id=eni-0900d2a19d6a43e6c]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-d12d5010-d8ec-40a4-9d2b-01789c637644]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.composer_brew will be created
  + resource "aws_instance" "composer_brew" {
      + ami                          = "ami-0c82f7789103a1e20"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.small"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "mhayden"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Composer for Brew"
          + "ServiceOwner" = "Image Builder"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "8c88f27e18f662808b106c9d880280746e027f14"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_interface_id  = "eni-0900d2a19d6a43e6c"
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.composer_brew (deposed object 43be1ffe) will be destroyed
  - resource "aws_instance" "composer_brew" {
      - ami                          = "ami-0c82f7789103a1e20" -> null
      - arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-07cc2dbf5378ab3ff" -> null
      - associate_public_ip_address  = false -> null
      - availability_zone            = "us-east-1a" -> null
      - cpu_core_count               = 1 -> null
      - cpu_threads_per_core         = 2 -> null
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - get_password_data            = false -> null
      - hibernation                  = false -> null
      - id                           = "i-07cc2dbf5378ab3ff" -> null
      - instance_state               = "running" -> null
      - instance_type                = "t3.small" -> null
      - ipv6_address_count           = 0 -> null
      - ipv6_addresses               = [] -> null
      - key_name                     = "mhayden" -> null
      - monitoring                   = false -> null
      - primary_network_interface_id = "eni-077fffb4a75357210" -> null
      - private_dns                  = "ip-10-30-18-50.ec2.internal" -> null
      - private_ip                   = "10.30.18.50" -> null
      - secondary_private_ips        = [] -> null
      - security_groups              = [] -> null
      - source_dest_check            = true -> null
      - subnet_id                    = "subnet-04a176042c3118735" -> null
      - tags                         = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "Composer for Brew"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - tenancy                      = "default" -> null
      - user_data                    = "8c88f27e18f662808b106c9d880280746e027f14" -> null
      - volume_tags                  = {} -> null
      - vpc_security_group_ids       = [
          - "sg-00c2bbbe779d66f49",
          - "sg-0835b6ea478c7ad22",
        ] -> null

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - snapshot_id           = "snap-05a7993c8f6c354c1" -> null
          - volume_id             = "vol-0b6b5fa2823f0e171" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - volume_id             = "vol-0b6b5fa2823f0e171" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_volume_attachment.composer_brew will be created
  + resource "aws_volume_attachment" "composer_brew" {
      + device_name = "/dev/sdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = "vol-0283d2f41d161a2d6"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*